---
kind: other
id: Methods.T:Autodesk.Revit.DB.ReferencePointArrayIterator
source: html/d84219ac-669a-fd6b-0424-09449fab5f8c.htm
---
# ReferencePointArrayIterator Methods

Causes the object to release immediately any resources it may be utilizing.